# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/homebrew-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

# Apps
cask 'backblaze'
cask 'bartender'
cask 'dropbox'
cask 'google-chrome'
cask 'graphiql'

# CLI apps
brew 'awscli'
brew 'curl'
brew 'git'
brew 'hub'
brew 'jq'
brew 'kubernetes-cli'
brew 'mas'
brew 'watch'
brew 'wget'

# Communication
cask 'skype'

# Editors
cask 'atom'

# Languages and runtimes
cask 'docker'
brew 'elixir'
brew 'node'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'ruby-build'

# Music
cask 'spotify'

# App Store Apps
mas '1Password', id: 443987910
mas 'Acorn 5', id: 1019272813
mas 'Alfred', id: 405843582
mas 'Alternote', id: 974971992
mas 'Annotate', id: 918207447
mas 'Aware', id: 1082170746
mas 'BreakTime', id: 427475982
mas 'Calca', id: 635758264
mas 'Evernote', id: 406056744
mas 'Fantastical', id: 975937182
mas 'GIF Brewery', id: 1081413713
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Mactracker', id: 430255202
mas 'Screeny', id: 440991524
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
mas 'You Need a Budget 4', id: 614680722
